Конфигурация/Documents/ПереводЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереводЦенныхБумаг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумагЗаблокированные</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереводСЗаблокированногоСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛицАнкетные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛицАнкетные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КППКрупнейшегоНалогоплательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КИО</Name>
					<Comment>Код иностранной организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факсы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСтраница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентПо173ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоНахождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВТорговыхСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКодовВТорговыхСистемах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыПИФ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УправляющаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УправляющиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПереводЦенныхБумаг/Ext/ManagerModule.bsl
Функция СформироватьСводноеПоручение(ПереводыЦенныхБумаг) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПереводыЦенныхБумаг",	ПереводыЦенныхБумаг);
	Запрос.УстановитьПараметр("Период",					ТекущаяДата());
	Запрос.УстановитьПараметр("НСД",					ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_НСД"));
	Запрос.УстановитьПараметр("НФОТехнологии",			ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_НФО_Технологии"));
	Запрос.УстановитьПараметр("ПроизошлоСлияниеНСД",	Запрос.Параметры.Период >= '20260720');
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Зачисление"" КАК ТипОперации,
		|	ЕСТЬNULL(РеквизитыОрганизации.КраткоеНаименованиеПоУставу, ПереводЦенныхБумаг.Организация.ЮрФизЛицо.Наименование) КАК ОтправительСообщения,
		|	ВЫБОР
		|		КОГДА &ПроизошлоСлияниеНСД
		|			ТОГДА ""АО """"НФО Технологии""""""
		|		ИНАЧЕ ""АО """"НСД""""""
		|	КОНЕЦ КАК ПолучательСообщения,
		|	ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Договор.НаименованиеВладельцаДляДокументов КАК НаименованиеДепонента,
		|	""Договор об оказании и СД услуг УК"" КАК ДокументОснование,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Договор.НомерДоговора
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель.Договор.НомерДоговора
		|	КОНЕЦ КАК НомерДокументаОснования,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Договор.ДатаЗаключения
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель.Договор.ДатаЗаключения
		|	КОНЕЦ КАК ДатаДокументаОснования,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.НомерСчета
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель.НомерСчета
		|	КОНЕЦ КАК НомерСчетаДепо,
		|	""220001"" КАК НомерРаздела,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ""00000000000000000""
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.НомерСчета
		|	КОНЕЦ КАК Раздел,
		|	""НКО АО НРД"" КАК ДепозитарийРегистратор,
		|	ЕСТЬNULL(РеквизитыДепозитарияОтправителя.КраткоеНаименованиеПоУставу, ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо.Наименование) КАК Владедец,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчет.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ""00000000000000000""
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчет.НомерСчета
		|	КОНЕЦ КАК РазделСчетаВДепозитарии,
		|	НАЧАЛОПЕРИОДА(ПереводЦенныхБумаг.Дата, ДЕНЬ) КАК ДатаСделки,
		|	НАЧАЛОПЕРИОДА(ПереводЦенныхБумаг.Дата, ДЕНЬ) КАК ДатаРасчетов,
		|	""Свободная поставка"" КАК ТипРасчетов,
		|	НАЧАЛОПЕРИОДА(ПереводЦенныхБумаг.Дата, ДЕНЬ) КАК ДатаПоручения,
		|	ПереводЦенныхБумаг.Ссылка КАК ПереводЦенныхБумаг,
		|	ПереводЦенныхБумаг.Дата КАК Дата,
		|	ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий КАК Депозитарий,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчет.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ПереводЦенныхБумаг.ДепозитарныйСчет.ВидСчета
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчет.Родитель.ВидСчета
		|	КОНЕЦ КАК ВидДепозитарногоСчетаСчетаОтправителя,
		|	ПереводЦенныхБумаг.СчетДоверительногоУправления.СпециализированныйДепозитарий КАК СпециализированныйДепозитарий
		|ПОМЕСТИТЬ _ДанныеДокумента
		|ИЗ
		|	Документ.ПереводЦенныхБумаг КАК ПереводЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации
		|		ПО ПереводЦенныхБумаг.Организация.ЮрФизЛицо = РеквизитыОрганизации.ЮрФизЛицо
		|			И ПереводЦенныхБумаг.Организация = РеквизитыОрганизации.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыДепозитарияОтправителя
		|		ПО ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо = РеквизитыДепозитарияОтправителя.ЮрФизЛицо
		|ГДЕ
		|	ПереводЦенныхБумаг.Ссылка В(&ПереводыЦенныхБумаг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ""Облигация""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя)
		|			ТОГДА ""Вексель""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Закладные)
		|			ТОГДА ""Закладная""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ""Ипотечный сертификат участия""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА ""Депозитарная расписка""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|			ТОГДА ""Фьючерс""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|			ТОГДА ""Опцион""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары)
		|			ТОГДА ""Валютная пара""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|			ТОГДА ""Доля""
		|	КОНЕЦ КАК ТипЦеннойБумаги,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Закладные)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Закладные).Банк.Наименование)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НаименованиеЭмитентаЦБ,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ЦеннаяБумага,
		|	ПереводЦенныхБумагЦенныеБумаги.Количество КАК Количество,
		|	ПереводЦенныхБумагЦенныеБумаги.НомерСтроки КАК ИсходящийНомерПоручения,
		|	ПереводЦенныхБумагЦенныеБумаги.Ссылка КАК ПереводЦенныхБумаг
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	Документ.ПереводЦенныхБумаг.ЦенныеБумаги КАК ПереводЦенныхБумагЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Закладные)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	ПереводЦенныхБумагЦенныеБумаги.Ссылка В(&ПереводыЦенныхБумаг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыСЦентральнымДепозитарием.ДепозитарнаяКомпания КАК Депозитарий,
		|	ДоговорыСЦентральнымДепозитарием.Период КАК Период,
		|	ДоговорыСЦентральнымДепозитарием.НомерТорговогоСчета КАК НомерТорговогоСчета,
		|	ДоговорыСЦентральнымДепозитарием.НомерОсновногоСчета КАК НомерОсновногоСчета,
		|	ДоговорыСЦентральнымДепозитарием.Идентификатор КАК Идентификатор,
		|	ДоговорыСЦентральнымДепозитарием.ДатаДоговора КАК ДатаМеждепозитарногоДоговора,
		|	ДоговорыСЦентральнымДепозитарием.НомерДоговора КАК НомерМеждепозитарногоДоговора
		|ПОМЕСТИТЬ _ДоговорыДепозитариевСЦентральнымДепозитарием
		|ИЗ
		|	РегистрСведений.ДоговорыСЦентральнымДепозитарием КАК ДоговорыСЦентральнымДепозитарием
		|ГДЕ
		|	ДоговорыСЦентральнымДепозитарием.ДепозитарнаяКомпания В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ДанныеДокумента.Депозитарий КАК Депозитарий
		|			ИЗ
		|				_ДанныеДокумента КАК _ДанныеДокумента
		|		
		|			ОБЪЕДИНИТЬ
		|		
		|			ВЫБРАТЬ
		|				&НСД
		|		
		|			ОБЪЕДИНИТЬ
		|		
		|			ВЫБРАТЬ
		|				&НФОТехнологии)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий КАК Депозитарий,
		|	_ДанныеДокумента.Дата КАК Дата,
		|	МИНИМУМ(_ДоговорыДепозитариевСЦентральнымДепозитарием.Период) КАК Период
		|ПОМЕСТИТЬ _ПериодыНачалаИспользованияДоговоров
		|ИЗ
		|	_ДанныеДокумента КАК _ДанныеДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДоговорыДепозитариевСЦентральнымДепозитарием КАК _ДоговорыДепозитариевСЦентральнымДепозитарием
		|		ПО (_ДанныеДокумента.Депозитарий = _ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий
		|				ИЛИ _ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий В (&НСД, &НФОТехнологии))
		|			И _ДанныеДокумента.Дата >= _ДоговорыДепозитариевСЦентральнымДепозитарием.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеДокумента.Дата,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыНачалаИспользованияДоговоров.Депозитарий КАК Депозитарий,
		|	_ПериодыНачалаИспользованияДоговоров.Дата КАК Дата,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.НомерТорговогоСчета КАК НомерТорговогоСчета,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.НомерОсновногоСчета КАК НомерОсновногоСчета,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.Идентификатор КАК Идентификатор,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.НомерМеждепозитарногоДоговора КАК НомерМеждепозитарногоДоговора,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.ДатаМеждепозитарногоДоговора КАК ДатаМеждепозитарногоДоговора
		|ПОМЕСТИТЬ _ДанныеДоговоровСЦД
		|ИЗ
		|	_ПериодыНачалаИспользованияДоговоров КАК _ПериодыНачалаИспользованияДоговоров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДоговорыДепозитариевСЦентральнымДепозитарием КАК _ДоговорыДепозитариевСЦентральнымДепозитарием
		|		ПО _ПериодыНачалаИспользованияДоговоров.Депозитарий = _ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий
		|			И _ПериодыНачалаИспользованияДоговоров.Период = _ДоговорыДепозитариевСЦентральнымДепозитарием.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДанныеДокумента.ТипОперации КАК ТипОперации,
		|	_ДанныеДокумента.ОтправительСообщения КАК ОтправительСообщения,
		|	_ДанныеДокумента.ПолучательСообщения КАК ПолучательСообщения,
		|	_ДанныеДокумента.НаименованиеДепонента КАК НаименованиеДепонента,
		|	_ДанныеДокумента.ДокументОснование КАК ДокументОснование,
		|	_ДанныеДокумента.НомерДокументаОснования КАК НомерДокументаОснования,
		|	_ДанныеДокумента.ДатаДокументаОснования КАК ДатаДокументаОснования,
		|	_ДанныеДоговоровСЦД_Междепозитарный.НомерМеждепозитарногоДоговора КАК НомерМеждепозитарногоДоговора,
		|	_ДанныеДоговоровСЦД_Междепозитарный.ДатаМеждепозитарногоДоговора КАК ДатаМеждепозитарногоДоговора,
		|	_ДанныеДокумента.НомерСчетаДепо КАК НомерСчетаДепо,
		|	_ДанныеДокумента.НомерРаздела КАК НомерРаздела,
		|	_ДанныеДокумента.Раздел КАК Раздел,
		|	_ЦенныеБумаги.ТипЦеннойБумаги КАК ТипЦеннойБумаги,
		|	_ЦенныеБумаги.НаименованиеЭмитентаЦБ КАК НаименованиеЭмитентаЦБ,
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.Количество КАК Количество,
		|	_ДанныеДокумента.ДепозитарийРегистратор КАК ДепозитарийРегистратор,
		|	_ДанныеДокумента.Владедец КАК Владедец,
		|	ВЫБОР
		|		КОГДА _ДанныеДокумента.ВидДепозитарногоСчетаСчетаОтправителя = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Торговый)
		|			ТОГДА _ДанныеДоговоровСЦД.НомерТорговогоСчета
		|		ИНАЧЕ _ДанныеДоговоровСЦД.НомерОсновногоСчета
		|	КОНЕЦ КАК НомерСчетаВДепозитарии,
		|	_ДанныеДоговоровСЦД.Идентификатор КАК КодДепонента,
		|	_ДанныеДокумента.РазделСчетаВДепозитарии КАК РазделСчетаВДепозитарии,
		|	_ДанныеДокумента.ДатаСделки КАК ДатаСделки,
		|	_ДанныеДокумента.ДатаРасчетов КАК ДатаРасчетов,
		|	_ДанныеДокумента.ТипРасчетов КАК ТипРасчетов,
		|	_ЦенныеБумаги.ИсходящийНомерПоручения КАК ИсходящийНомерПоручения,
		|	_ДанныеДокумента.ДатаПоручения КАК ДатаПоручения,
		|	_ДанныеДокумента.Дата КАК Дата
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеДокумента КАК _ДанныеДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеДоговоровСЦД КАК _ДанныеДоговоровСЦД
		|			ПО _ДанныеДокумента.Депозитарий = _ДанныеДоговоровСЦД.Депозитарий
		|				И _ДанныеДокумента.Дата = _ДанныеДоговоровСЦД.Дата
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеДоговоровСЦД КАК _ДанныеДоговоровСЦД_Междепозитарный
		|			ПО (_ДанныеДоговоровСЦД_Междепозитарный.Депозитарий В (&НСД, &НФОТехнологии))
		|				И _ДанныеДокумента.Дата = _ДанныеДоговоровСЦД_Междепозитарный.Дата
		|		ПО _ЦенныеБумаги.ПереводЦенныхБумаг = _ДанныеДокумента.ПереводЦенныхБумаг
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	#КонецОбласти
	
	Макет = Документы.ПереводЦенныхБумаг.ПолучитьМакет("СводноеПоручение");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	Результат.Вывести(ОбластьШапка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.ИсходящийНомерПоручения = НомерСтроки;
		Результат.Вывести(ОбластьСтрока);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
